# Test2

In [ ]:
#default_exp test2

In [ ]:
#export
import pandas as pd
data1 = {
    "ID": [ 1, 2, 3, 4, 5],
    "age": [ 0, 0, 0, 0, 0]
}

data2 = {
    "ID" : [ 1, 2, 3, 4, 5 ],
    "age" : [ 6, 7, 8, 9, 10 ]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

   ID  age
0   1    0
1   2    0
2   3    0
3   4    0
4   5    0

In [ ]:
#hide
for i in range(len(df1)):
    df1.iloc[i]= df2.iloc[i] 
    print(df1.iloc[i])

ID     1
age    6
Name: 0, dtype: int64
ID     2
age    7
Name: 1, dtype: int64
ID     3
age    8
Name: 2, dtype: int64
ID     4
age    9
Name: 3, dtype: int64
ID      5
age    10
Name: 4, dtype: int64

In [ ]:
df1

   ID  age
0   1    0
1   2    0
2   3    0
3   4    0
4   5    0

In [ ]:
#export
df1["age"] = df2[df2.ID == df1.ID]["age"]
df2

   ID  age
0   1    6
1   2    7
2   3    8
3   4    9
4   5   10